//Создайте три строковые переменные и присвойте им значения: 
//    "\nмоя строка 1”; " +
//    ""\tмоя строка 2”; 
//"\aмоя строка 3".
//    Выведите значение каждой переменной на экран. Какие отличия вы увидели? Сделайте выводы.

Console.Write("\nмоя строка 1");
Console.Write("\tмоя строка 2");
Console.Write("\aмоя строка 3");
